<?php/* =================================================////
////																										 ////
////                     Шаблон L-пакета				         ////
////																										 ////
////=====================================================////
//// 			        		 		   ////
//// 			  Оглавление			 ////
//// 			         				   ////
////=========================////


    А. Содержимое HEAD html-разметки шаблона
    ----------------------------------------
      А1. Подключение тэга title с названием документа
      А2. Подключение локального CSS документа

    Б. Содержимое BODY html-разметки шаблона
    ----------------------------------------
      Б1. ...

    В. Подключение ресурсов шаблона
    -------------------------------
      В1. Принять данные для шаблона с сервера
      В2. Подключение JS-скрипта наследника шаблона


////==================================================== */?>

<!doctype html>
<html lang="ru">


<?php /*----------------------------------------->
<!-- А. Содержимое HEAD html-разметки шаблона  -->
<!-------------------------------------------*/ ?>
<head>
  <meta charset="UTF-8">

  <?php /*-- А1. Подключение тэга title с названием документа -->
  <!--------------------------------------------------------*/ ?>
  @yield('title')

  <?php /*-- А2. Подключение локального CSS документа -->
  <!------------------------------------------------*/ ?>
  @yield('css')

</head>

<?php /*----------------------------------------->
<!-- Б. Содержимое BODY html-разметки шаблона  -->
<!-------------------------------------------*/ ?>
<body>

  <?php /*------------------------>
  <!-- Экран загрузки документа -->
  <!--------------------------*/ ?>
  <div class="start-loading-screen loader">
    <div class="loader-inner ball-scale-ripple-multiple" style="position: absolute; top: 50%; left: 50%; transform: translateY(-100px) translateX(-100px); width: 200px; height: 200px;">
      <div style="width: 200px; height: 200px; border-color: #f39c26; left: 0; top: 0;"></div>
      <div style="width: 200px; height: 200px; left: 0; top: 0;"></div>
      <div style="width: 200px; height: 200px; border-color: #f39c26; left: 0; top: 0;"></div>
    </div>
  </div>


  <?php /*--------------->
  <!-- Содержимое BODY -->
  <!-----------------*/ ?>
  <div id="content" class="content">
    @yield('content')
  </div>

</body>
</html>


<?php /*-------------------------------->
<!-- В. Подключение ресурсов шаблона  -->
<!----------------------------------*/ ?>

  <?php /*----------------------------------------->
  <!-- В1. Принять данные для шаблона с сервера  -->
  <!-------------------------------------------*/ ?>
  <script>

    // 1. Подготовить объект для JS-кода шаблона
    window["layout_PARAMpackfullnamePARAM"] = {};

    // 2. Принять данные для шаблона

      window["layout_PARAMpackfullnamePARAM"].csrf_token  = "{{ csrf_token() }}";

  </script>

  <?php /*---------------------------------------------->
  <!-- В2. Подключение JS-скрипта наследника шаблона  -->
  <!------------------------------------------------*/ ?>

    <?php /* JS наследника шаблона */ ?>
    @yield('js')








